app/views/channels/_form.html.erb

SELECT "batches".* FROM "batches"
---
  <%= f.label :batch_id %>
  <%= f.collection_select :batch_id,Batch.all, :id,:name,prompt: "Select a Batch" %><br/>

SELECT "students".* FROM "students"
---
  <%= f.label :student %>
  <%= f.collection_check_boxes(:student_ids,Student.all,:id,:name)%><br/>