app/views/batches/show.html.erb

<ul>
 <% @batch.channels.each do |channel| %>
---
SELECT "channels".* FROM "channels" WHERE "channels"."batch_id" = ?  [["batch_id", 1]]