app/controllers/batches_controller.rb

SELECT "batches".* FROM "batches"
---
  def index
    @batches = Batch.all

SELECT  "batches".* FROM "batches" WHERE "batches"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @batch = Batch.find(params[:id])

INSERT INTO "batches" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "b-wd-jan-2017"], ["created_at", "2017-06-22 11:15:22.615133"], ["updated_at", "2017-06-22 11:15:22.615133"]]
---
  def create
    @batch = Batch.new(batch_params)
    respond_to do |format|
      if @batch.save

SELECT  "batches".* FROM "batches" WHERE "batches"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_batch
      @batch = Batch.find(params[:id])