app/controllers/channels_controller.rb

SELECT "channels".* FROM "channels"
---
  def index
    @channels = Channel.all

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT 1  [["id", 1]]
---
  def show

    @channel = Channel.find(params[:id])

INSERT INTO "channels" ("name", "batch_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ch-wd-jan2017"], ["batch_id", 1], ["created_at", "2017-06-21 16:40:17.047672"], ["updated_at", "2017-06-21 16:40:17.047672"]]
INSERT INTO "subscriptions" ("student_id", "channel_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["channel_id", 13], ["created_at", "2017-06-23 12:08:22.425577"], ["updated_at", "2017-06-23 12:08:22.425577"]]
---
  def create
<<<<<<< HEAD

@channel = Channel.new(channel_params)

=begin
params[:channel][:id].each do |student|
    if !student.empty?
    @channel.subscriptions.build(:student_id => student)
    end

end
=end


    #respond_to do |format|
      if @channel.save

DELETE FROM "channels" WHERE "channels"."id" = ?  [["id", 1]]
---
  def destroy
    @channel.destroy

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_channel
      @channel = Channel.find(params[:id])